-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 13, 2026 at 11:24 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bloodbridge_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `blood_requests`
--

CREATE TABLE `blood_requests` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `organization_id` bigint(20) UNSIGNED NOT NULL,
  `blood_type` tinyint(3) UNSIGNED NOT NULL,
  `units_needed` int(10) UNSIGNED NOT NULL,
  `urgency_level` tinyint(3) UNSIGNED NOT NULL DEFAULT 1,
  `additional_notes` text DEFAULT NULL,
  `search_radius_km` int(10) UNSIGNED NOT NULL DEFAULT 10,
  `status` tinyint(3) UNSIGNED NOT NULL DEFAULT 0,
  `donors_accepted` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `donors_completed` int(10) UNSIGNED NOT NULL DEFAULT 0,
  `broadcasted_at` timestamp NULL DEFAULT NULL,
  `fulfilled_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `blood_requests`
--

INSERT INTO `blood_requests` (`id`, `organization_id`, `blood_type`, `units_needed`, `urgency_level`, `additional_notes`, `search_radius_km`, `status`, `donors_accepted`, `donors_completed`, `broadcasted_at`, `fulfilled_at`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 1, 6, 3, 1, 'طلب عينة بيانات حقيقية للتجربة', 19, 3, 0, 0, NULL, '2025-09-06 01:59:33', NULL, '2025-09-04 06:59:33', '2026-01-13 08:57:49'),
(2, 5, 2, 2, 2, 'طلب عينة بيانات حقيقية للتجربة', 12, 1, 0, 0, NULL, NULL, NULL, '2025-09-17 06:59:33', '2025-09-20 09:46:33'),
(3, 1, 7, 2, 4, 'طلب عينة بيانات حقيقية للتجربة', 14, 4, 0, 0, NULL, NULL, NULL, '2025-05-08 06:59:33', '2025-05-09 09:39:33'),
(4, 2, 5, 2, 4, 'طلب عينة بيانات حقيقية للتجربة', 7, 3, 0, 0, NULL, '2025-07-16 02:59:33', NULL, '2025-07-15 06:59:33', '2025-07-16 07:06:33'),
(5, 3, 5, 5, 4, 'طلب عينة بيانات حقيقية للتجربة', 7, 3, 0, 0, '2025-02-07 08:07:33', '2025-02-08 22:59:33', NULL, '2025-02-07 07:59:33', '2025-02-14 01:29:33'),
(6, 2, 3, 10, 4, 'طلب عينة بيانات حقيقية للتجربة', 13, 5, 0, 0, NULL, NULL, NULL, '2025-11-26 07:59:33', '2025-12-01 05:13:33'),
(7, 1, 4, 10, 2, 'طلب عينة بيانات حقيقية للتجربة', 6, 3, 0, 0, '2025-11-14 08:16:33', '2025-11-15 03:59:33', NULL, '2025-11-14 07:59:33', '2025-11-17 09:00:33'),
(8, 4, 3, 9, 3, 'طلب عينة بيانات حقيقية للتجربة', 10, 3, 0, 0, NULL, '2025-04-12 10:59:33', NULL, '2025-04-12 06:59:33', '2025-04-18 07:59:33'),
(9, 1, 6, 5, 4, 'طلب عينة بيانات حقيقية للتجربة', 5, 3, 0, 0, NULL, '2025-05-08 09:59:33', NULL, '2025-05-08 06:59:33', '2025-05-08 20:06:33'),
(10, 1, 3, 8, 2, 'طلب عينة بيانات حقيقية للتجربة', 14, 3, 0, 0, NULL, '2025-03-17 18:59:33', NULL, '2025-03-17 07:59:33', '2025-03-21 16:49:33'),
(11, 3, 3, 9, 4, 'طلب عينة بيانات حقيقية للتجربة', 20, 3, 0, 0, NULL, '2025-04-07 17:59:33', NULL, '2025-04-06 06:59:33', '2025-04-11 21:30:33'),
(12, 3, 7, 5, 3, 'طلب عينة بيانات حقيقية للتجربة', 13, 3, 0, 0, '2025-11-21 08:04:33', '2025-11-22 19:59:33', NULL, '2025-11-21 07:59:33', '2025-11-21 23:40:33'),
(13, 2, 6, 4, 1, 'طلب عينة بيانات حقيقية للتجربة', 16, 3, 0, 0, '2025-01-29 08:15:33', '2025-01-29 10:59:33', NULL, '2025-01-29 07:59:33', '2025-01-30 18:29:33'),
(14, 2, 2, 10, 3, 'طلب عينة بيانات حقيقية للتجربة', 10, 3, 0, 0, NULL, '2025-10-19 19:59:33', NULL, '2025-10-18 06:59:33', '2025-10-20 04:44:33'),
(15, 2, 2, 10, 3, 'طلب عينة بيانات حقيقية للتجربة', 9, 3, 0, 0, '2025-05-07 07:11:33', '2025-05-07 14:59:33', NULL, '2025-05-07 06:59:33', '2025-05-09 02:10:33'),
(16, 4, 2, 5, 1, 'طلب عينة بيانات حقيقية للتجربة', 19, 2, 0, 0, '2025-09-27 07:21:33', NULL, NULL, '2025-09-27 06:59:33', '2025-09-27 10:11:33'),
(17, 4, 6, 2, 3, 'طلب عينة بيانات حقيقية للتجربة', 18, 0, 0, 0, '2025-08-17 07:04:33', NULL, NULL, '2025-08-17 06:59:33', '2025-08-18 17:05:33'),
(18, 5, 2, 6, 3, 'طلب عينة بيانات حقيقية للتجربة', 10, 3, 0, 0, NULL, '2025-06-25 17:59:33', NULL, '2025-06-24 06:59:33', '2025-06-29 03:46:33'),
(19, 1, 7, 1, 2, 'طلب عينة بيانات حقيقية للتجربة', 6, 0, 0, 0, NULL, NULL, NULL, '2025-06-09 06:59:33', '2025-06-13 19:30:33'),
(20, 2, 5, 6, 3, 'طلب عينة بيانات حقيقية للتجربة', 7, 3, 0, 0, '2025-10-22 07:28:33', '2025-10-23 20:59:33', NULL, '2025-10-22 06:59:33', '2025-10-25 00:24:33'),
(21, 4, 2, 1, 2, 'طلب عينة بيانات حقيقية للتجربة', 14, 2, 0, 0, '2025-06-09 07:10:33', NULL, NULL, '2025-06-09 06:59:33', '2025-06-11 18:26:33'),
(22, 1, 6, 4, 4, 'طلب عينة بيانات حقيقية للتجربة', 15, 5, 0, 0, '2025-08-10 07:13:33', NULL, NULL, '2025-08-10 06:59:33', '2025-08-15 18:14:33'),
(23, 4, 5, 2, 4, 'طلب عينة بيانات حقيقية للتجربة', 7, 3, 0, 0, '2025-03-07 08:20:33', '2025-03-08 10:59:33', NULL, '2025-03-07 07:59:33', '2025-03-11 00:41:33'),
(24, 3, 4, 7, 2, 'طلب عينة بيانات حقيقية للتجربة', 10, 3, 0, 0, '2025-05-05 07:24:33', '2025-05-06 16:59:33', NULL, '2025-05-05 06:59:33', '2025-05-07 08:51:33'),
(25, 1, 4, 6, 1, 'طلب عينة بيانات حقيقية للتجربة', 8, 3, 0, 0, '2025-12-23 08:28:33', '2025-12-23 15:59:33', NULL, '2025-12-23 07:59:33', '2025-12-30 06:19:33'),
(26, 1, 1, 5, 2, 'طلب عينة بيانات حقيقية للتجربة', 7, 3, 0, 0, '2025-09-10 07:24:33', '2025-09-12 01:59:33', NULL, '2025-09-10 06:59:33', '2025-09-17 02:40:33'),
(27, 2, 3, 5, 4, 'طلب عينة بيانات حقيقية للتجربة', 13, 3, 0, 0, '2025-03-08 08:15:33', '2025-03-09 14:59:33', NULL, '2025-03-08 07:59:33', '2025-03-09 07:00:33'),
(28, 2, 5, 8, 3, 'طلب عينة بيانات حقيقية للتجربة', 8, 3, 0, 0, '2025-01-16 08:04:33', '2025-01-16 09:59:33', NULL, '2025-01-16 07:59:33', '2025-01-18 08:23:33'),
(29, 2, 7, 6, 3, 'طلب عينة بيانات حقيقية للتجربة', 18, 3, 0, 0, NULL, '2025-10-28 22:59:33', NULL, '2025-10-28 07:59:33', '2025-11-02 23:13:33'),
(30, 5, 8, 9, 4, 'طلب عينة بيانات حقيقية للتجربة', 11, 3, 0, 0, '2025-11-25 08:28:33', '2025-11-25 16:59:33', NULL, '2025-11-25 07:59:33', '2025-11-25 22:08:33'),
(31, 3, 6, 6, 4, 'طلب عينة بيانات حقيقية للتجربة', 6, 0, 0, 0, '2025-09-19 07:07:33', NULL, NULL, '2025-09-19 06:59:33', '2025-09-23 11:36:33'),
(32, 2, 1, 4, 4, 'طلب عينة بيانات حقيقية للتجربة', 15, 3, 0, 0, NULL, '2025-11-15 22:59:33', NULL, '2025-11-15 07:59:33', '2025-11-20 16:33:33'),
(33, 5, 1, 10, 1, 'طلب عينة بيانات حقيقية للتجربة', 17, 0, 0, 0, '2025-07-08 07:20:33', NULL, NULL, '2025-07-08 06:59:33', '2025-07-09 18:01:33'),
(34, 1, 1, 8, 4, 'طلب عينة بيانات حقيقية للتجربة', 11, 3, 0, 0, '2025-05-30 07:10:33', '2025-05-31 07:59:33', NULL, '2025-05-30 06:59:33', '2025-06-01 19:13:33'),
(35, 5, 7, 5, 3, 'طلب عينة بيانات حقيقية للتجربة', 7, 3, 0, 0, '2025-11-11 08:29:33', '2025-11-12 02:59:33', NULL, '2025-11-11 07:59:33', '2025-11-13 13:29:33'),
(36, 4, 8, 2, 2, 'طلب عينة بيانات حقيقية للتجربة', 6, 2, 0, 0, NULL, NULL, NULL, '2025-03-20 07:59:33', '2025-03-25 08:33:33'),
(37, 3, 3, 6, 3, 'طلب عينة بيانات حقيقية للتجربة', 20, 3, 0, 0, '2025-06-06 07:16:33', '2025-06-08 05:59:33', NULL, '2025-06-06 06:59:33', '2025-06-08 11:11:33'),
(38, 4, 8, 5, 1, 'طلب عينة بيانات حقيقية للتجربة', 10, 3, 0, 0, NULL, '2025-10-28 06:59:33', NULL, '2025-10-27 07:59:33', '2025-10-30 22:04:33'),
(39, 1, 7, 9, 3, 'طلب عينة بيانات حقيقية للتجربة', 8, 3, 0, 0, '2025-12-09 08:19:33', '2025-12-11 03:59:33', NULL, '2025-12-09 07:59:33', '2025-12-14 16:39:33'),
(40, 5, 5, 4, 2, 'طلب عينة بيانات حقيقية للتجربة', 18, 3, 0, 0, NULL, '2025-07-26 10:59:33', NULL, '2025-07-25 06:59:33', '2025-07-27 16:32:33'),
(41, 5, 2, 7, 3, 'طلب عينة بيانات حقيقية للتجربة', 5, 3, 0, 0, '2025-04-10 07:19:33', '2025-04-11 23:59:33', NULL, '2025-04-10 06:59:33', '2025-04-10 11:05:33'),
(42, 4, 1, 6, 2, 'طلب عينة بيانات حقيقية للتجربة', 19, 3, 0, 0, '2025-05-13 07:22:33', '2025-05-14 09:59:33', NULL, '2025-05-13 06:59:33', '2025-05-16 11:00:33'),
(43, 5, 5, 9, 3, 'طلب عينة بيانات حقيقية للتجربة', 14, 1, 0, 0, NULL, NULL, NULL, '2025-03-01 07:59:33', '2025-03-02 07:44:33'),
(44, 3, 5, 4, 1, 'طلب عينة بيانات حقيقية للتجربة', 9, 4, 0, 0, NULL, NULL, NULL, '2025-03-02 07:59:33', '2025-03-06 08:23:33'),
(45, 3, 5, 4, 4, 'طلب عينة بيانات حقيقية للتجربة', 5, 3, 0, 0, '2025-08-12 07:16:33', '2025-08-13 12:59:33', NULL, '2025-08-12 06:59:33', '2025-08-18 13:32:33'),
(46, 2, 8, 9, 1, 'طلب عينة بيانات حقيقية للتجربة', 8, 5, 0, 0, NULL, NULL, NULL, '2026-01-01 07:59:33', '2026-01-07 01:05:33'),
(47, 4, 3, 5, 3, 'طلب عينة بيانات حقيقية للتجربة', 14, 4, 0, 0, NULL, NULL, NULL, '2025-09-22 06:59:33', '2025-09-24 00:29:33'),
(48, 3, 8, 3, 1, 'طلب عينة بيانات حقيقية للتجربة', 5, 3, 0, 0, '2025-08-11 07:26:33', '2025-08-11 13:59:33', NULL, '2025-08-11 06:59:33', '2025-08-17 10:41:33'),
(49, 2, 6, 2, 1, 'طلب عينة بيانات حقيقية للتجربة', 8, 3, 0, 0, NULL, '2025-08-12 07:59:33', NULL, '2025-08-11 06:59:33', '2025-08-17 02:53:33'),
(50, 3, 6, 7, 2, 'طلب عينة بيانات حقيقية للتجربة', 20, 3, 0, 0, '2025-10-11 07:21:33', '2025-10-11 09:59:33', NULL, '2025-10-11 06:59:33', '2025-10-15 21:49:33');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `blood_requests`
--
ALTER TABLE `blood_requests`
  ADD PRIMARY KEY (`id`),
  ADD KEY `blood_requests_organization_id_foreign` (`organization_id`),
  ADD KEY `blood_requests_blood_type_index` (`blood_type`),
  ADD KEY `blood_requests_urgency_level_index` (`urgency_level`),
  ADD KEY `blood_requests_status_index` (`status`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `blood_requests`
--
ALTER TABLE `blood_requests`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `blood_requests`
--
ALTER TABLE `blood_requests`
  ADD CONSTRAINT `blood_requests_organization_id_foreign` FOREIGN KEY (`organization_id`) REFERENCES `organizations` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
